In [151]:
#импортируем стандартные библиотеки
%matplotlib inline
import pandas as pd
from matplotlib import pyplot as plt

In [152]:
# (1) Используя параметры pandas прочитать красиво пандас 
df = pd.read_csv #TODO
df = pd.read_csv('UCI_Credit_Card.csv')
# на лекции называли train, а не df - data frame

In [153]:
# default
# df.head(n=5) 
df.head(4)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default.payment.next.month
0,1,20000.0,2,2,1,24,2,2,-1,-1,...,0.0,0.0,0.0,0.0,689.0,0.0,0.0,0.0,0.0,1
1,2,120000.0,2,2,2,26,-1,2,0,0,...,3272.0,3455.0,3261.0,0.0,1000.0,1000.0,1000.0,0.0,2000.0,1
2,3,90000.0,2,2,2,34,0,0,0,0,...,14331.0,14948.0,15549.0,1518.0,1500.0,1000.0,1000.0,1000.0,5000.0,0
3,4,50000.0,2,2,1,37,0,0,0,0,...,28314.0,28959.0,29547.0,2000.0,2019.0,1200.0,1100.0,1069.0,1000.0,0

In [154]:
# (2) выведите, что за типы переменных, сколько пропусков,
# для численных значений посчитайте пару статистик (в свободной форме)

### pandas: shape

In [155]:
# Выведем сколько данных (строки, столбцы)
df.shape

(30000, 25)

### pandas: columns, index

In [156]:
# df.columns
# # type(df.columns)
# df[df.columns].head(6)
for i in df.columns:
    print(i)
# for item in list(df.columns):
#     print(item)

ID
LIMIT_BAL
SEX
EDUCATION
MARRIAGE
AGE
PAY_0
PAY_2
PAY_3
PAY_4
PAY_5
PAY_6
BILL_AMT1
BILL_AMT2
BILL_AMT3
BILL_AMT4
BILL_AMT5
BILL_AMT6
PAY_AMT1
PAY_AMT2
PAY_AMT3
PAY_AMT4
PAY_AMT5
PAY_AMT6
default.payment.next.month

In [157]:
# установленный индекс от 0 до 30 000 с шагом в 1
df.index

RangeIndex(start=0, stop=30000, step=1)

In [385]:
# (2) выведите, что за типы переменных, сколько пропусков
# Выведем типы данных и остальную информацию
df.info(memory_usage=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 25 columns):
ID                            30000 non-null int64
LIMIT_BAL                     30000 non-null float64
SEX                           30000 non-null int64
EDUCATION                     30000 non-null int64
MARRIAGE                      30000 non-null int64
AGE                           30000 non-null int64
PAY_0                         30000 non-null int64
PAY_2                         30000 non-null int64
PAY_3                         30000 non-null int64
PAY_4                         30000 non-null int64
PAY_5                         30000 non-null int64
PAY_6                         30000 non-null int64
BILL_AMT1                     30000 non-null float64
BILL_AMT2                     30000 non-null float64
BILL_AMT3                     30000 non-null float64
BILL_AMT4                     30000 non-null float64
BILL_AMT5                     30000 non-null float64
BILL_AMT6                     30000 non-null float64
PAY_AMT1                      30000 non-null float64
PAY_AMT2                      30000 non-null float64
PAY_AMT3                      30000 non-null float64
PAY_AMT4                      30000 non-null float64
PAY_AMT5                      30000 non-null float64
PAY_AMT6                      30000 non-null float64
default.payment.next.month    30000 non-null int64
dtypes: float64(13), int64(12)
memory usage: 5.7 MB

|       enclude       |       exclude       |
| ------------------- | ------------------- |
| включить в список   | исключить из списка |
| или белый список    | или черный список   |
https://github.com/sandino/Markdown-Cheatsheet

In [386]:
# для численных значений посчитайте пару статистик (в свободной форме)
# статистика с перцентилем в 99% 
df.describe(percentiles=[0.9,0.99])
#| enclude / exclude | включить - белый список | исключить - черный списки |

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default.payment.next.month
count,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,...,30000.000000,30000.000000,30000.000000,30000.000000,3.000000e+04,30000.00000,30000.000000,30000.000000,30000.000000,30000.000000
mean,15000.500000,167484.322667,1.603733,1.853133,1.551867,35.485500,-0.016700,-0.133767,-0.166200,-0.220667,...,43262.948967,40311.400967,38871.760400,5663.580500,5.921163e+03,5225.68150,4826.076867,4799.387633,5215.502567,0.221200
std,8660.398374,129747.661567,0.489129,0.790349,0.521970,9.217904,1.123802,1.197186,1.196868,1.169139,...,64332.856134,60797.155770,59554.107537,16563.280354,2.304087e+04,17606.96147,15666.159744,15278.305679,17777.465775,0.415062
min,1.000000,10000.000000,1.000000,0.000000,0.000000,21.000000,-2.000000,-2.000000,-2.000000,-2.000000,...,-170000.000000,-81334.000000,-339603.000000,0.000000,0.000000e+00,0.00000,0.000000,0.000000,0.000000,0.000000
50%,15000.500000,140000.000000,2.000000,2.000000,2.000000,34.000000,0.000000,0.000000,0.000000,0.000000,...,19052.000000,18104.500000,17071.000000,2100.000000,2.009000e+03,1800.00000,1500.000000,1500.000000,1500.000000,0.000000
90%,27000.100000,360000.000000,2.000000,3.000000,2.000000,49.000000,2.000000,2.000000,2.000000,2.000000,...,122418.700000,115883.000000,112110.400000,10300.000000,1.040110e+04,10000.00000,9570.600000,9500.000000,9600.000000,1.000000
99%,29700.010000,500000.000000,2.000000,5.000000,3.000000,60.000000,3.000000,3.000000,3.000000,3.000000,...,304997.270000,285868.330000,279505.060000,66522.180000,7.665102e+04,70000.00000,67054.440000,65607.560000,82619.050000,1.000000
max,30000.000000,1000000.000000,2.000000,6.000000,3.000000,79.000000,8.000000,8.000000,8.000000,8.000000,...,891586.000000,927171.000000,961664.000000,873552.000000,1.684259e+06,896040.00000,621000.000000,426529.000000,528666.000000,1.000000

In [160]:
# Посчитаем статистики
# Example:
# df.head().T возвращает новый df не изменяя текущего (транспорирование)
# df.describe().T

In [290]:
def is_SmartFemale(s,m):
    return ('2' in s and '2' in m)

In [291]:
is_SmartFemale('2','2')

True

In [363]:
# Выведем только пол (2) и образование (2)
df[
    (df['SEX'] ==2) & (df['EDUCATION']== 2)
].head(5)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default.payment.next.month
0,1,20000.0,2,2,1,24,2,2,-1,-1,...,0.0,0.0,0.0,0.0,689.0,0.0,0.0,0.0,0.0,1
1,2,120000.0,2,2,2,26,-1,2,0,0,...,3272.0,3455.0,3261.0,0.0,1000.0,1000.0,1000.0,0.0,2000.0,1
2,3,90000.0,2,2,2,34,0,0,0,0,...,14331.0,14948.0,15549.0,1518.0,1500.0,1000.0,1000.0,1000.0,5000.0,0
3,4,50000.0,2,2,1,37,0,0,0,0,...,28314.0,28959.0,29547.0,2000.0,2019.0,1200.0,1100.0,1069.0,1000.0,0
7,8,100000.0,2,2,2,23,0,-1,-1,0,...,221.0,-159.0,567.0,380.0,601.0,0.0,581.0,1687.0,1542.0,0

In [384]:
# (3) посчитать число женщин с университетским образованием
# SEX (1 = male; 2 = female). 
# EDUCATION (1 = graduate school; 2 = university; 3 = high school; 4 = others). 

#TODO
answer = df[
    (df['SEX'] ==2) & (df['EDUCATION']== 2)
].shape
print(answer[0])

8656

#### group_by

In [358]:
columns_to_show = ['SEX', 'EDUCATION']
df.groupby(['SEX'])[columns_to_show].describe(percentiles=[])

         SEX                          EDUCATION                                \
       count mean  std  min  50%  max     count      mean       std  min  50%
SEX
1    11888.0  1.0  0.0  1.0  1.0  1.0   11888.0  1.839250  0.793884  0.0  2.0
2    18112.0  2.0  0.0  2.0  2.0  2.0   18112.0  1.862246  0.787908  0.0  2.0


     max
SEX
1    6.0
2    6.0

In [362]:
# (4) Сгрупировать по "default payment next month" и посчитать медиану для всех показателей начинающихся на BILL_ и PAY_
#TODO
line = []
for i in df.columns:
#     print(i)
    if ('BILL_') in i:
#         print(i)
        line.append(i)
    elif('PAY_') in i:
#         print(i) 
        line.append(i)
# print(line)      
columns_to_show = line
# df.groupby(['default.payment.next.month'])[columns_to_show].describe(percentiles=[]).T
df.groupby(['default.payment.next.month'])[columns_to_show].median()

,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,BILL_AMT1,BILL_AMT2,BILL_AMT3,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6
default.payment.next.month,,,,,,,,,,,,,,,,,,
0,0,0,0,0,0,0,23119.5,21660.5,20202.5,19000.0,17998.0,16679.0,2459.5,2247.5,2000.0,1734.0,1765.0,1706.0
1,1,0,0,0,0,0,20185.0,20300.5,19834.5,19119.5,18478.5,18028.5,1636.0,1533.5,1222.0,1000.0,1000.0,1000.0

In [393]:
# (5) постройте сводную таблицу (pivot table) по SEX, EDUCATION, MARRIAGE
df.pivot_table #TODO
d = df.pivot_table('SEX', 'EDUCATION', 'MARRIAGE')
d

MARRIAGE          0         1         2         3
EDUCATION
0               NaN  1.500000  1.400000       NaN
1          1.750000  1.545943  1.613306  1.400000
2          1.833333  1.653610  1.581197  1.611111
3          1.727273  1.633695  1.531692  1.650485
4               NaN  1.653846  1.661765  1.666667
5               NaN  1.680000  1.637795  1.666667
6               NaN  1.500000  1.476190  2.000000

In [397]:
# процент пола по образованию
# d.div(d, axis='rows')
df[['EDUCATION', 'SEX']].groupby('SEX').count()
# заменить 1 на мужчину и 2 на женщину

     EDUCATION
SEX
1        11888
2        18112

In [405]:
# (6) Создать новый строковый столбец в data frame-е, который:
# принимает значение A, если значение LIMIT_BAL <=10000
# принимает значение B, если значение LIMIT_BAL <=100000 и >10000
# принимает значение C, если значение LIMIT_BAL <=200000 и >100000
# принимает значение D, если значение LIMIT_BAL <=400000 и >200000
# принимает значение E, если значение LIMIT_BAL <=700000 и >400000
# принимает значение F, если значение LIMIT_BAL >700000
#TODO

In [476]:
# добавим для теста функции
LIMIT_BALL=750000
# type(LIMIT_BALL)

In [477]:
def is_ABC(lim):
    LIMIT_BAL=lim
    if LIMIT_BAL<=10000:
        lim='A'
    elif (LIMIT_BAL<=100000 & LIMIT_BAL>10000):
        lim='B'
    elif (LIMIT_BAL<=200000 & LIMIT_BAL>100000):
        lim='C'
    elif (LIMIT_BAL<=400000 & LIMIT_BAL>200000):
        lim='D'
    elif (LIMIT_BAL<=700000 & LIMIT_BAL>400000):
        lim='E'
    elif (LIMIT_BAL>700000):
        lim='C'
    return lim

In [494]:
is_ABC(LIMIT_BALL)

'C'

# домашка в процессе

In [496]:
# черновик
df['LIMIT_BAL']

0         20000.0
1        120000.0
2         90000.0
3         50000.0
4         50000.0
5         50000.0
6        500000.0
7        100000.0
8        140000.0
9         20000.0
10       200000.0
11       260000.0
12       630000.0
13        70000.0
14       250000.0
15        50000.0
16        20000.0
17       320000.0
18       360000.0
19       180000.0
20       130000.0
21       120000.0
22        70000.0
23       450000.0
24        90000.0
25        50000.0
26        60000.0
27        50000.0
28        50000.0
29        50000.0
           ...
29970    360000.0
29971     80000.0
29972    190000.0
29973    230000.0
29974     50000.0
29975    220000.0
29976     40000.0
29977    420000.0
29978    310000.0
29979    180000.0
29980     50000.0
29981     50000.0
29982     90000.0
29983     20000.0
29984     30000.0
29985    240000.0
29986    360000.0
29987    130000.0
29988    250000.0
29989    150000.0
29990    140000.0
29991    210000.0
29992     10000.0
29993    100000.0
29994     80000.0
29995    220000.0
29996    150000.0
29997     30000.0
29998     80000.0
29999     50000.0
Name: LIMIT_BAL, Length: 30000, dtype: float64

In [ ]:
%matplotlib inline
import numpy as np

In [ ]:
# (7) постироить распределение LIMIT_BAL (гистрограмму)

In [ ]:
df #TODO

In [ ]:
# (8) построить среднее значение кредитного лимита для каждого вида образования 
# и для каждого пола
# график необходимо сделать очень широким (на весь экран)
df #TODO

In [ ]:
# (9) построить зависимость кредитного лимита и образования только для одного из полов

#TODO

In [ ]:
# (10) построить большой график (подсказка - используя seaborn) для построения завимисости всех возможных пар параметров
# разным цветом выделить разные значение "default payment next month"
# (но так как столбцов много - картинка может получиться "монструозной")
# (поэкспериментируйте над тем как построить подобное сравнение параметров)
# (подсказка - ответ может состоять из несколькольких графиков)
# (если не выйдет - программа минимум - построить один график со всеми параметрами)
import seaborn as sns

#TODO